STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
/**
  ******************************************************************************
  * @file    stm32_custom_driver.c
  * @author  MCD Application Team
  * @brief   This file includes a driver for custom support
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_extmem.h"
#include "stm32_extmem_conf.h"

#if defined(EXTMEM_DRIVER_CUSTOM) && (EXTMEM_DRIVER_CUSTOM == 1)
#include "stm32_custom_driver_api.h"
#include "stm32_custom_driver_type.h"

#if EXTMEM_DRIVER_CUSTOM_DEBUG_LEVEL != 0 && defined(EXTMEM_MACRO_DEBUG)
#include <stdio.h>
#endif /*EXTMEM_DRIVER_CUSTOM_DEBUG_LEVEL != 0 && defined(EXTMEM_MACRO_DEBUG)*/

/** @defgroup CUSTOM CUSTOM driver
  * @ingroup EXTMEM_DRIVER
  * @{
  */

/* Private Macro ------------------------------------------------------------*/
/** @defgroup CUSTOM_Private_Macro Private Macro
  * @{
  */

#if EXTMEM_DRIVER_CUSTOM_DEBUG_LEVEL > 0 && defined(EXTMEM_MACRO_DEBUG)
/**
  * @brief Debug macro for a string
  */
#define DEBUG_STR(_STR_)                            \
  {                                                 \
    EXTMEM_MACRO_DEBUG(_STR_);                      \
    EXTMEM_MACRO_DEBUG("\n\r");                     \
  }
/**
  * @brief Debug macro for a string and a value (hex)
  */
#define DEBUG_STR_HEX(_STR_,_HEX_ )                 \
  {                                                 \
    char str[10];                                   \
    (void)sprintf(str, "0x%x", _HEX_);              \
    EXTMEM_MACRO_DEBUG("\t ");                      \
    EXTMEM_MACRO_DEBUG(_STR_);                      \
    EXTMEM_MACRO_DEBUG(str);                        \
    EXTMEM_MACRO_DEBUG("\n\r");                     \
  }
/**
  * @brief Debug macro for a string and a value (int)
  */
#define DEBUG_STR_INT(_STR_,_INT_ )                 \
  {                                                 \
    char str[10];                                   \
    (void)sprintf(str, "%i", _INT_);                \
    EXTMEM_MACRO_DEBUG("\t ");                      \
    EXTMEM_MACRO_DEBUG(_STR_);                      \
    EXTMEM_MACRO_DEBUG(str);                        \
    EXTMEM_MACRO_DEBUG("\n\r");                     \
  }

#define DEBUG_API()       EXTMEM_MACRO_DEBUG("\n\r CUSTOM API: ");
#define DEBUG_INTERNAL_BLOCK()   \
  EXTMEM_MACRO_DEBUG("\t =======================================\n\r ");
#else

/**
  * @brief Debug macro
  */
#define DEBUG_STR_HEX(_STR_,_HEX_ )
#define DEBUG_STR_INT(_STR_,_INT_ )
#define DEBUG_STR(_STR_)
#define DEBUG_API()
#define DEBUG_INTERNAL_BLOCK()

#endif /* EXTMEM_DRIVER_CUSTOM_DEBUG_LEVEL > 0 && defined(EXTMEM_MACRO_DEBUG) */

/**
  * @brief MIN macro
  */
#define MIN(_A_,_B_)   ((_A_) > (_B_))?(_B_):(_A_);

/**
  * @}
  */


/* Private typedefs ---------------------------------------------------------*/

/* Status values returned by internal Custom XSPI driver functions.
   Indicates success (OK) or failure (KO) of an operation.  */
typedef enum
{
  CUSTOM_XSPI_OK  =  0,   /*!< Operation successful */
  CUSTOM_XSPI_KO  = -1,   /*!< Operation failed */
} CUSTOM_XSPI_StatusTypeDef;

/* Selection of Read Register command from configuration
 * (depending on sequence, i.e. if Read Register is done prior or after Write operation)
 */
typedef enum
{
  CUSTOM_XSPI_READ_TYPE_INITIAL = 0,
  CUSTOM_XSPI_READ_TYPE_AFTER_WRITE,
} CUSTOM_XSPI_ReadTypeTypeDef;

/* Definition of RESET Instructions */
#define CUSTOM_RESET_INS_66_8BITS           0x66U
#define CUSTOM_RESET_INS_99_8BITS           0x99U
#define CUSTOM_RESET_INS_FF_8BITS           0xFFU

#define CUSTOM_RESET_INS_6699_16BITS        0x6699U
#define CUSTOM_RESET_INS_9966_16BITS        0x9966U
#define CUSTOM_RESET_INS_6666_16BITS        0x6666U
#define CUSTOM_RESET_INS_9999_16BITS        0x9999U

/* Definition of the clock value above which rounding is performed */
#define CUSTOM_CLOCK_VALUE_FOR_ROUNDING     50000000U
#define CUSTOM_CLOCK_VALUE_INCREMENT        1000000U

/* Private variables ---------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_Init(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject);
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_DeInit(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject);
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetClock(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                      uint32_t ClockIn, uint32_t ClockRequested);
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_ReadRegister(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                          OptionalRegisterConfigTypeDef *RegisterConfig,
                                                          CUSTOM_XSPI_ReadTypeTypeDef ReadType);
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_WriteRegister(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                           OptionalRegisterConfigTypeDef *RegisterConfig);
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_Send_Instruction(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                              uint32_t Instruction);
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_ResetMemory(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject);

/* Prepare XSPI Command depending on memory configuration */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetCommand(MemoryBaseConfigTypeDef *ConfigObject,
                                                        XSPI_RegularCmdTypeDef *sCommand);
/* Save, restore current memory configuration command */
static void CUSTOM_XSPI_SaveCommand(XSPI_RegularCmdTypeDef *sCommand, uint32_t *CommandToSave);
static void CUSTOM_XSPI_RestoreCommand(XSPI_RegularCmdTypeDef *sCommand, uint32_t *CommandSaved);

