STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetWriteCommand(MemoryBaseConfigTypeDef *ConfigObject,
                                                             XSPI_RegularCmdTypeDef *sCommand);
/* Used for NorFlash only */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetWriteEnable(XSPI_HandleTypeDef *hxspi, XSPI_RegularCmdTypeDef *sCommand,
                                                            NorFlashBasConfigTypeDef *NorConfig);
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_GetWriteInProgress(XSPI_HandleTypeDef *hxspi,
                                                                XSPI_RegularCmdTypeDef *sCommand,
                                                                NorFlashBasConfigTypeDef *NorConfig,
                                                                uint32_t Timeout);

static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_GetJedecID(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject);

/** @defgroup CUSTOM_Exported_Functions Exported Functions
  * @{
  */

/**
  * @brief Initializes the CUSTOM driver, configures the XSPI peripheral, and sets up the memory device
  *        according to data provided in Custom driver object (configuration data).
  * @note
  * The initialization sequence as described in Custom driver object could include the following steps:
  *   - Send first command with basic configuration (e.g. 1S1S1S)
  *   - Send (n) configuration register commands and read back each one:
  *     - Check Write In Progress (WIP)
  *     - Write Enable (WE)
  *     - Check Write Enable Latch (WEL)
  *     - Write configuration register
  *     - Read back register to verify
  *   - Initialize clock frequency to maximum
  *   - Send second command with normal configuration (e.g. 4D4D4D)
  *   - At this stage, full configuration and frequency are applied
  * @param hxspi Pointer to the XSPI peripheral handle.
  * @param ClockInput Input clock frequency for the XSPI peripheral.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_Init(XSPI_HandleTypeDef *hxspi,  uint32_t ClockInput,
                                                             EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;
  uint32_t iConfig = 0;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_Init");

  /* Handle */
  CustomObject->Private.Handle = (XSPI_HandleTypeDef *)hxspi;

  /* Init XSPI peripheral */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_Init(CustomObject))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_INIT;
    goto error;
  }

  /* Initialize memory clock frequency to its startup (default) configuration */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetClock(CustomObject, ClockInput, CustomObject->StartupConfig.Frequency))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_CLOCK_INIT;
    goto error;
  }

  /* Init Command details, based on Startup configuration */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->StartupConfig, &CustomObject->Private.Commandbase))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
    goto error;
  }

  /* Implementation of reset procedure if specified in configuration file */
  if (CustomObject->ResetMethod != EXTMEM_CUSTOM_RESET_METHOD_UNDEFINED)
  {
    /* Execute Reset procedure */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_ResetMemory(CustomObject))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_RESET_MEMORY;
      goto error;
    }
  }

  /* Initialize Current NorFlash config in private structure */
  if (CustomObject->MemType == EXTMEM_CUSTOM_NOR_FLASH)
  {
    CustomObject->Private.CurrentFlashConfig = &CustomObject->NorFlashConfig.Startup;

    /* Get JedecID in case of NorFlash memory */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetJedecID(CustomObject))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_JEDEC_ID;
      goto error;
    }
  }

  /* Apply optional register configuration steps if described in configuration file */
  while (iConfig < (CustomObject->NbRegisterConfig))
  {
    DEBUG_INTERNAL_BLOCK();
    DEBUG_STR_INT("[CONFIG STEP] ", iConfig);

    /* Send Read/Write configuration commands to registers inside memory */
    if (IS_CFGSTEP_REG_ACCESS_TYPE(CustomObject->RegisterConfig[iConfig].ConfigStepType))
    {
      /* Send Read Register command to memory */
      if (IS_CFGSTEP_REG_R_ACCESS(CustomObject->RegisterConfig[iConfig].ConfigStepType))
      {
        if (CUSTOM_XSPI_OK != CUSTOM_XSPI_ReadRegister(CustomObject, &CustomObject->RegisterConfig[iConfig],
                                                       CUSTOM_XSPI_READ_TYPE_INITIAL))
        {
          retr = EXTMEM_DRV_CUSTOM_ERR_READ_REGISTER;
          goto error;
        }
      }

      /* Send Write Register command to memory */
      if (IS_CFGSTEP_REG_W_ACCESS(CustomObject->RegisterConfig[iConfig].ConfigStepType))
      {
        /* In case of Nor Flash device, check WIP flag in memory status register
           and send Write Enable command */
        if (CustomObject->MemType == EXTMEM_CUSTOM_NOR_FLASH)
        {
          /* WIP Command*/
          if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(CustomObject->Private.Handle,
                                                               &CustomObject->Private.Commandbase,
                                                               CustomObject->Private.CurrentFlashConfig,
                                                               CUSTOM_XSPI_TIMEOUT_VALUE))
          {
            retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
            goto error;
          }

          /* WE Command*/
          if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetWriteEnable(CustomObject->Private.Handle,
                                                           &CustomObject->Private.Commandbase,
                                                           CustomObject->Private.CurrentFlashConfig))
          {
            retr = EXTMEM_DRV_CUSTOM_ERR_WRITE_ENABLE;
            goto error;
          }
        }

