STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
        if (CUSTOM_XSPI_OK != CUSTOM_XSPI_WriteRegister(CustomObject, &CustomObject->RegisterConfig[iConfig]))
        {
          retr = EXTMEM_DRV_CUSTOM_ERR_WRITE_REGISTER;
          goto error;
        }
      }

      /* Send Read Register command to memory for verification */
      if (IS_CFGSTEP_REG_RAW_ACCESS(CustomObject->RegisterConfig[iConfig].ConfigStepType))
      {
        if (CustomObject->MemType == EXTMEM_CUSTOM_NOR_FLASH)
        {
          /* WIP Command : ensure previous command has been handled */
          if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(CustomObject->Private.Handle,
                                                               &CustomObject->Private.Commandbase,
                                                               CustomObject->Private.CurrentFlashConfig,
                                                               CUSTOM_XSPI_TIMEOUT_VALUE))
          {
            retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
            goto error;
          }
        }

        /* Read after Write operation (to check value) : only if config type is RW or RWR */
        if (IS_CFGSTEP_REG_RAW_ACCESS(CustomObject->RegisterConfig[iConfig].ConfigStepType))
        {
          if (CUSTOM_XSPI_OK != CUSTOM_XSPI_ReadRegister(CustomObject, &CustomObject->RegisterConfig[iConfig],
                                                         CUSTOM_XSPI_READ_TYPE_AFTER_WRITE))
          {
            retr = EXTMEM_DRV_CUSTOM_ERR_READ_REGISTER;
            goto error;
          }

          /* Write verification */
          /*
          if(tmpReg != CustomObject->Private.ReadRegValue)
          {
            while(1);
          }
          */
        }
      }
    }
    /* Send single instruction to memory */
    else if (IS_CFGSTEP_INST_TYPE(CustomObject->RegisterConfig[iConfig].ConfigStepType))
    {
      /* Basic command case */
      if (IS_CFGSTEP_INS_BASIC(CustomObject->RegisterConfig[iConfig].ConfigStepType))
      {
        if (CUSTOM_XSPI_OK !=
            CUSTOM_XSPI_Send_Instruction(CustomObject,
                                         CustomObject->RegisterConfig[iConfig].INSConfigStep.Instruction))
        {
          retr = EXTMEM_DRV_CUSTOM_ERR_SEND_INSTRUCTION;
          goto error;
        }
      }
    }
    /* Execute new Optional configuration if required */
    else if (IS_CFGSTEP_EXEC_OPT_CFG_TYPE(CustomObject->RegisterConfig[iConfig].ConfigStepType))
    {

      /* Initialize memory clock frequency to its final (optional) configuration */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetClock(CustomObject, ClockInput, CustomObject->OptionalConfig.Frequency))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_CLOCK_INIT;
        goto error;
      }

      /* Init Command with optional config */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->OptionalConfig,
                                                   &CustomObject->Private.Commandbase))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
        goto error;
      }

      if (CustomObject->NorFlashConfig.OptionalConfigEnable)
      {
        /* Initialize Current NorFlash config */
        CustomObject->Private.CurrentFlashConfig = &CustomObject->NorFlashConfig.Optional;
      }
    }
    else
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_CONFIG_STEP;
      goto error;
    }

    /* Go to next configuration Step */
    iConfig++;
  }

  DEBUG_INTERNAL_BLOCK();

error:
  return retr;
}

/**
  * @brief Deinitializes the XSPI peripheral and the associated CUSTOM driver.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_DeInit(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_DeInit");

  /* Deinitializes the XSPI peripheral and associated CUSTOM driver */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_DeInit(CustomObject))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_DEINIT;
  }

  return retr;
}

/**
  * @brief Reads data from the memory device.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @param Address Address to read from in the memory.
  * @param Data Pointer to the data buffer to store the read data.
  * @param Size Size of data to read (in bytes).
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_Read(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                             uint32_t Address, uint8_t *Data, uint32_t Size)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;
  XSPI_RegularCmdTypeDef *sCommand   = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi          = CustomObject->Private.Handle;
  MemoryBaseConfigTypeDef *MemConfig;
  NorFlashBasConfigTypeDef *NorConfig;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_Read");

  /* Verify if Memory is a NorFlash */
  if (IS_NOT_MEMORY_FLASH(CustomObject->MemType))
  {
    return EXTMEM_DRV_CUSTOM_ERR_MEMORY_TYPE;
  }

  /* Check which memory configuration is to be used */
  if (CustomObject->OptionalConfig.Frequency != 0U)
  {
    MemConfig = &CustomObject->OptionalConfig;
  }
  else
  {
    MemConfig = &CustomObject->StartupConfig;
  }

  /* Set specific NorFlash memory configuration and check WIP */
  if (CustomObject->MemType == EXTMEM_CUSTOM_NOR_FLASH)
  {
    /* Init NorFlash configuration */
    if (CustomObject->NorFlashConfig.OptionalConfigEnable)
    {
      NorConfig = &CustomObject->NorFlashConfig.Optional;

      /* Init Command */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(MemConfig, &CustomObject->Private.Commandbase))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      }
    }
    else
    {
      NorConfig = &CustomObject->NorFlashConfig.Startup;

      /* Init Command */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(MemConfig, &CustomObject->Private.Commandbase))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      }
    }

    /* WIP Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(hxspi, sCommand,  NorConfig, CUSTOM_XSPI_TIMEOUT_VALUE))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
      goto error;
    }
  }

  /* Init Command */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(MemConfig, &CustomObject->Private.Commandbase))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
  }

  /* Read the data */
  sCommand->OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->Instruction        = MemConfig->CommandRead;
  sCommand->DummyCycles        = MemConfig->DummyCycleRead;
  sCommand->Address            = Address;
  sCommand->DataLength         = Size;

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
    goto error;
  }

  if (HAL_XSPI_Receive(hxspi, Data, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
    goto error;
  }
error:
  return retr;
}

/**
  * @brief Writes data to the memory device.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @param Address Address to write to in the memory.
  * @param Data Pointer to the data buffer to be written.
  * @param Size Size of data to be written (in bytes).
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_Write(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                              uint32_t Address, const uint8_t *Data, uint32_t Size)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;
  XSPI_RegularCmdTypeDef *sCommand        = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi               = CustomObject->Private.Handle;
  uint32_t size_write;
  uint32_t local_size                     = Size;
  uint32_t local_Address                  = Address;
  uint32_t local_Data                     = (uint32_t)Data;
  uint32_t misalignment                   = 0u;
  MemoryBaseConfigTypeDef *MemConfig;
  NorFlashBasConfigTypeDef *NorConfig;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_Write");

