STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
  /*
   *  Here need to separate in 2 different functions for write operation
   *  - NorFlash_Write
   *  - HyperFlash_Write
   */

  /* Verify if Memory is a NorFlash */
  if (IS_NOT_MEMORY_FLASH(CustomObject->MemType))
  {
    return EXTMEM_DRV_CUSTOM_ERR_MEMORY_TYPE;
  }

  /* Check which memory configuration is to be used */
  if (CustomObject->OptionalConfig.Frequency != 0U)
  {
    MemConfig = &CustomObject->OptionalConfig;
  }
  else
  {
    MemConfig = &CustomObject->StartupConfig;
  }

  /* Check if write address is on a page frontier */
  if (0u != (local_Address % CustomObject->NorFlashConfig.PageSize))
  {
    misalignment = 1u;
  }

  /* Loop until write operation is completed */
  while (local_size != 0u)
  {
    /* Compute size to be written according to alignment status */
    if (misalignment == 1u)
    {
      /* PAGE_SIZE or Boundary */
      size_write = CustomObject->NorFlashConfig.PageSize - (local_Address % CustomObject->NorFlashConfig.PageSize);
      size_write = MIN(local_size, size_write);
      misalignment = 0u;
    }
    else
    {
      /* PAGE_SIZE or Boundary */
      size_write = MIN(local_size, CustomObject->NorFlashConfig.PageSize);
    }

    if (CustomObject->MemType == EXTMEM_CUSTOM_NOR_FLASH)
    {
      /* Check which memory configuration is to be used */
      if (CustomObject->NorFlashConfig.OptionalConfigEnable)
      {
        NorConfig = &CustomObject->NorFlashConfig.Optional;

        /* Init Command */
        if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->OptionalConfig, &CustomObject->Private.Commandbase))
        {
          retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
        }
      }
      else
      {
        NorConfig = &CustomObject->NorFlashConfig.Startup;

        /* Init Command */
        if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->StartupConfig, &CustomObject->Private.Commandbase))
        {
          retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
        }
      }

      /* WIP Command */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(hxspi, sCommand,  NorConfig, CUSTOM_XSPI_TIMEOUT_VALUE))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
        goto error;
      }

      /* WE Command */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetWriteEnable(hxspi, sCommand,  NorConfig))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_WRITE_ENABLE;
        goto error;
      }
    }

    /* Init write Command */
    if (IS_ACCESS_MODE_TYPE(MemConfig->OptWriteAccessMode))
    {
      /* Use optional write access mode to build command if needed */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetWriteCommand(MemConfig, &CustomObject->Private.Commandbase))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      }
    }
    else
    {
      /* Set global memory configuration */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(MemConfig, &CustomObject->Private.Commandbase))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      }
    }

    /* Write the data */
    sCommand->OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
    sCommand->Instruction        = MemConfig->CommandWrite;
    sCommand->DummyCycles        = MemConfig->DummyCycleWrite;
    sCommand->Address            = local_Address;
    sCommand->DataLength         = size_write;

    if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
      goto error;
    }

    if (HAL_XSPI_Transmit(hxspi, (uint8_t *)local_Data, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
      goto error;
    }

    /* Update counters */
    local_size = local_size - size_write;
    local_Address = local_Address + size_write;
    local_Data = local_Data + size_write;
  }

  /* In case of Nor Flash, check for Write operation completion before exiting function */
  if (CustomObject->MemType == EXTMEM_CUSTOM_NOR_FLASH)
  {
    /* Check which memory configuration is to be used */
    if (CustomObject->NorFlashConfig.OptionalConfigEnable)
    {
      /* Init Command */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->OptionalConfig, &CustomObject->Private.Commandbase))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      }
    }
    else
    {
      /* Init Command */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->StartupConfig, &CustomObject->Private.Commandbase))
      {
        retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      }
    }

    /* WIP Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(CustomObject->Private.Handle, sCommand,  NorConfig,
                                                         CUSTOM_XSPI_TIMEOUT_VALUE))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
      goto error;
    }
  }

error:
  return retr;
}

/**
  * @brief Erases sectors in the specified memory area (Address + Size).
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @param Address Address of the first sector to erase.
  * @param Size Size of the area to erase (in bytes).
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_EraseSector(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                                    uint32_t Address, uint32_t Size)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;
  XSPI_RegularCmdTypeDef *sCommand        = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi               = CustomObject->Private.Handle;
  uint32_t local_address                  = Address;
  uint32_t local_size                     = Size;
  uint32_t sector_size                    = CustomObject->NorFlashConfig.SectorSize;
  uint32_t SavedDataMode;
  uint32_t SavedDummyCycles;
  uint32_t max_timing;
  NorFlashBasConfigTypeDef *NorConfig;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_EraseSector");

  /* Verify if Memory is a NorFlash */
  if (IS_NOT_MEMORY_FLASH(CustomObject->MemType))
  {
    return EXTMEM_DRV_CUSTOM_ERR_MEMORY_TYPE;
  }

  /* Check if address is a modulo of sector size */
  if ((local_address % sector_size) != 0u)
  {
    return EXTMEM_DRV_CUSTOM_ERR_SECTOR_SIZE;
  }

  /* Check which memory configuration is to be used */
  if (CustomObject->NorFlashConfig.OptionalConfigEnable)
  {
    NorConfig = &CustomObject->NorFlashConfig.Optional;

    /* Init Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->OptionalConfig, &CustomObject->Private.Commandbase))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      goto error;
    }
  }
  else
  {
    NorConfig = &CustomObject->NorFlashConfig.Startup;

    /* Init Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->StartupConfig, &CustomObject->Private.Commandbase))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      goto error;
    }
  }

  /* Loop until enough sectors have been erased */
  while (local_size != 0u)
  {
    /* WIP Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(hxspi, sCommand,  NorConfig, CUSTOM_XSPI_TIMEOUT_VALUE))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
      goto error;
    }

    /* WE Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetWriteEnable(hxspi, sCommand,  NorConfig))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_WRITE_ENABLE;
      goto error;
    }

    /* Save Xspi command */
    SavedDataMode                = sCommand->DataMode;
    SavedDummyCycles             = sCommand->DummyCycles;

    /* Prepare Sector Erase Command */
    sCommand->Instruction        = NorConfig->Cmd_EraseSector;
    sCommand->Address            = local_address;
    sCommand->DataMode           = HAL_XSPI_DATA_NONE;
    sCommand->DummyCycles        = 0;

