STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
    if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE)  != HAL_OK)
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
      goto error;
    }

    /* Restore Xspi command */
    sCommand->DataMode    = SavedDataMode;
    sCommand->DummyCycles = SavedDummyCycles;

    /* Update Size and address to erase next sector */
    local_address = local_address + sector_size;
    if (sector_size > local_size)
    {
      local_size = 0u;
    }
    else
    {
      local_size = local_size - sector_size;
    }
  }

  /* Check default value of Max duration allowed for Eras operation.
     If 0, then use HAL_XSPI default timeout. */
  if (CustomObject->NorFlashConfig.MaxSectorEraseTime == 0)
  {
    max_timing = CUSTOM_XSPI_TIMEOUT_VALUE;
  }
  else
  {
    max_timing = CustomObject->NorFlashConfig.MaxSectorEraseTime;
  }

  /* WIP Command */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(hxspi, sCommand,  NorConfig, max_timing))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
    goto error;
  }

error:
  if (retr != EXTMEM_DRV_CUSTOM_OK)
  {
    DEBUG_STR("[ERROR] XSPI Abort");
    /* Abort any ongoing transaction for the next action */
    (void)HAL_XSPI_Abort(hxspi);
  }

  /* Restore Xspi command */
  sCommand->DataMode    = SavedDataMode;
  sCommand->DummyCycles = SavedDummyCycles;
  return retr;
}

/**
  * @brief Performs a mass erase of the entire memory device.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_MassErase(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;
  XSPI_RegularCmdTypeDef *sCommand = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi        = CustomObject->Private.Handle;
  uint32_t SavedCommand            = 0;
  uint32_t max_timing;
  NorFlashBasConfigTypeDef *NorConfig;

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_MassErase");

  /* Verify if Memory is a NorFlash */
  if (IS_NOT_MEMORY_FLASH(CustomObject->MemType))
  {
    return EXTMEM_DRV_CUSTOM_ERR_MEMORY_TYPE;
  }

  /* Check which memory configuration is to be used */
  if (CustomObject->NorFlashConfig.OptionalConfigEnable)
  {
    NorConfig = &CustomObject->NorFlashConfig.Optional;

    /* Init Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->OptionalConfig, &CustomObject->Private.Commandbase))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      goto error;
    }
  }
  else
  {
    NorConfig = &CustomObject->NorFlashConfig.Startup;

    /* Init Command */
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(&CustomObject->StartupConfig, &CustomObject->Private.Commandbase))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
      goto error;
    }
  }

  /* WIP Command */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(hxspi, sCommand,  NorConfig, CUSTOM_XSPI_TIMEOUT_VALUE))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
    goto error;
  }

  /* WE Command */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetWriteEnable(hxspi, sCommand,  NorConfig))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_WRITE_ENABLE;
    goto error;
  }

  /* Prepare Mass Erase Command */
  sCommand->Instruction        = NorConfig->Cmd_MassErase;
  sCommand->AddressMode        = HAL_XSPI_ADDRESS_NONE;
  sCommand->DataMode           = HAL_XSPI_DATA_NONE;
  sCommand->DummyCycles        = 0;

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE)  != HAL_OK)
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
    goto error;
  }

  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

  /* Check default value of Max duration allowed for Erase operation.
     If 0, then use HAL_XSPI default timeout. */
  if (CustomObject->NorFlashConfig.MaxChipEraseTime == 0)
  {
    max_timing = CUSTOM_XSPI_TIMEOUT_VALUE;
  }
  else
  {
    max_timing = CustomObject->NorFlashConfig.MaxChipEraseTime;
  }

  /* WIP Command */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_GetWriteInProgress(hxspi, sCommand,  NorConfig, max_timing))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_FLASH_BUSY;
    goto error;
  }

error:
  if (retr != EXTMEM_DRV_CUSTOM_OK)
  {
    /* Restore XSPI command previously saved */
    CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

    DEBUG_STR("[ERROR] XSPI Abort");
    /* Abort any ongoing transaction for the next action */
    (void)HAL_XSPI_Abort(hxspi);
  }

  return retr;
}

/**
  * @brief Enables memory-mapped mode for the memory device.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_Enable_MemoryMappedMode(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef
                                                                                *CustomObject)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;

  XSPI_RegularCmdTypeDef *sCommand   = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi          = CustomObject->Private.Handle;
  MemoryBaseConfigTypeDef *MemConfig;
  XSPI_MemoryMappedTypeDef sMemMappedCfg = {0};

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_Enable_MemoryMappedMode");

  /* Check which memory configuration is to be used */
  if (CustomObject->OptionalConfig.Frequency != 0U)
  {
    MemConfig = &CustomObject->OptionalConfig;
  }
  else
  {
    MemConfig = &CustomObject->StartupConfig;
  }

  /* Init Command */
  if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetCommand(MemConfig, &CustomObject->Private.Commandbase))
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
  }

  /* Initialize the read ID command */
  sCommand->OperationType = HAL_XSPI_OPTYPE_READ_CFG;
  sCommand->Instruction   = MemConfig->CommandRead;
  sCommand->DummyCycles   = MemConfig->DummyCycleRead;

  /* Configure the read command */
  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE)  != HAL_OK)
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
  }

  /* Init optional write Command */
  if (IS_ACCESS_MODE_TYPE(MemConfig->OptWriteAccessMode))
  {
    if (CUSTOM_XSPI_OK != CUSTOM_XSPI_SetWriteCommand(MemConfig, &CustomObject->Private.Commandbase))
    {
      retr = EXTMEM_DRV_CUSTOM_ERR_SET_COMMAND;
    }
  }

