STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
  /* Initialize the read ID command */
  sCommand->OperationType = HAL_XSPI_OPTYPE_WRITE_CFG;
  sCommand->Instruction   = MemConfig->CommandWrite;
  sCommand->DummyCycles   = MemConfig->DummyCycleWrite;
  /* Configure the read command */
  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE)  != HAL_OK)
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_XSPI_TIMEOUT;
  }

  /* Activation of memory-mapped mode */
  sMemMappedCfg.TimeOutActivation  = HAL_XSPI_TIMEOUT_COUNTER_DISABLE;
  sMemMappedCfg.TimeoutPeriodClock = 0x50;
  if (HAL_XSPI_MemoryMapped(hxspi, &sMemMappedCfg)  != HAL_OK)
  {
    retr = EXTMEM_DRV_CUSTOM_ERR_ENABLE_MEM_MAP;
  }

  if (retr != EXTMEM_DRV_CUSTOM_OK)
  {
    DEBUG_STR("[ERROR] XSPI Abort");
    /* Abort any ongoing transaction for the next action */
    (void)HAL_XSPI_Abort(hxspi);
  }

  /* return status */
  return retr;
}

/**
  * @brief Disables memory-mapped mode for the memory device.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_Disable_MemoryMappedMode(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef
    *CustomObject)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;
  XSPI_HandleTypeDef *hxspi               = CustomObject->Private.Handle;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_Disable_MemoryMappedMode");

  /* Abort any ongoing transaction for the next action */
  if (HAL_XSPI_Abort(hxspi) != HAL_OK)
  {
    DEBUG_STR("[ERROR] XSPI Abort");
    retr = EXTMEM_DRV_CUSTOM_ERR_DISABLE_MEM_MAP;
  }

  return retr;
}

/**
  * @brief Returns the base address of the memory device.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @param BaseAddress Pointer to store the base address.
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_GetMapAddress(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                                      uint32_t *BaseAddress)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_ERR;
  XSPI_HandleTypeDef *hxspi = CustomObject->Private.Handle;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_GetMapAddress");

  /* Retrieve XSPI1 base address from CMSIS file */
#if defined(XSPI1)
  if (hxspi->Instance == XSPI1)
  {
    *BaseAddress = XSPI1_BASE;
    retr = EXTMEM_DRV_CUSTOM_OK;
  }
#endif /* XSPI1 */
  /* Retrieve XSPI2 base address from CMSIS file */
#if defined(XSPI2)
  if (hxspi->Instance == XSPI2)
  {
    *BaseAddress = XSPI2_BASE;
    retr = EXTMEM_DRV_CUSTOM_OK;
  }
#endif /* XSPI2 */
  /* Retrieve XSPI3 base address from CMSIS file */
#if defined(XSPI3)
  if (hxspi->Instance == XSPI3)
  {
    *BaseAddress = XSPI3_BASE;
    retr = EXTMEM_DRV_CUSTOM_OK;
  }
#endif /* XSPI3 */
  /* Retrieve OCTOSPI1 base address from CMSIS file */
#if defined(OCTOSPI1)
  if (hxspi->Instance == OCTOSPI1)
  {
    *BaseAddress = OCTOSPI1_BASE;
    retr = EXTMEM_DRV_CUSTOM_OK;
  }
#endif /* OCTOSPI1 */
  /* Retrieve OCTOSPI2 base address from CMSIS file */
#if defined(OCTOSPI2)
  if (hxspi->Instance == OCTOSPI2)
  {
    *BaseAddress = OCTOSPI2_BASE;
    retr = EXTMEM_DRV_CUSTOM_OK;
  }
#endif /* OCTOSPI2 */
  /* Retrieve HSPI1 base address from CMSIS file */
#if defined(HSPI1)
  if (hxspi->Instance == HSPI1)
  {
    *BaseAddress = HSPI1_BASE;
    retr = EXTMEM_DRV_CUSTOM_OK;
  }
#endif /* HSPI1 */

  return retr;
}

/**
  * @brief Returns information about the memory device.
  * @param CustomObject Pointer to the CUSTOM driver object.
  * @param MemInfo Pointer to the memory information structure to be filled.
  * @retval EXTMEM_DRIVER_CUSTOM_StatusTypeDef: EXTMEM_DRV_CUSTOM_OK if successful, error code otherwise.
  */
EXTMEM_DRIVER_CUSTOM_StatusTypeDef EXTMEM_DRIVER_CUSTOM_GetInfo(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                                EXTMEM_DRIVER_CUSTOM_MemInfoTypeDef *MemInfo)
{
  EXTMEM_DRIVER_CUSTOM_StatusTypeDef retr = EXTMEM_DRV_CUSTOM_OK;
  XSPI_HandleTypeDef *hxspi = CustomObject->Private.Handle;

  DEBUG_API();
  DEBUG_STR("EXTMEM_DRIVER_CUSTOM_GetInfo");

  /* Fill MemInfo structure with memory information */
  MemInfo->MemType       = CustomObject->MemType;
  MemInfo->MemSize       =
    (EXTMEM_CUSTOM_MemSizeTypeDef)((hxspi->Instance->DCR1 & XSPI_DCR1_DEVSIZE) >> XSPI_DCR1_DEVSIZE_Pos);
  MemInfo->MemStandard   = (EXTMEM_CUSTOM_MemStdTypeDef)(hxspi->Instance->DCR1 & XSPI_DCR1_MTYP);
  MemInfo->MemAccessMode =
    (EXTMEM_CUSTOM_AccessModeTypeDef)(ACCESS_MODE_TYPE | (hxspi->Instance->CCR & (ACCESS_MODE_MASK)));
  MemInfo->MemRealFreq   = CustomObject->Private.RealClock;
  MemInfo->JedecID.ManufacturerID    = CustomObject->Private.JedecID.ManufacturerID;
  MemInfo->JedecID.MemoryType        = CustomObject->Private.JedecID.MemoryType;
  MemInfo->JedecID.MemoryDensity     = CustomObject->Private.JedecID.MemoryDensity;

  return retr;
}

/**
  * @}
  */

/** @addtogroup CUSTOM_Private_Functions
  * @{
  */

/**
  * @brief This function initializes the XSPI peripheral associated to Custom Driver object
  * @param CustomObject Custom driver object
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_Init(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject)
{
  CUSTOM_XSPI_StatusTypeDef retr = CUSTOM_XSPI_OK;
  /*
   * Some of the XSPI memory size initialization parameters, as MemorySize, MemoryType, ChipSelectHighTime, ...
   * are set according to values contained in configuration items present in CustomObject structure.
   */

  CustomObject->Private.Handle->Init.FifoThresholdByte       = 2;
  CustomObject->Private.Handle->Init.MemoryMode              = HAL_XSPI_SINGLE_MEM;
  CustomObject->Private.Handle->Init.MemoryType              = CustomObject->MemStandard;
  CustomObject->Private.Handle->Init.MemorySize              = CustomObject->MemSize;
  CustomObject->Private.Handle->Init.ChipSelectHighTimeCycle = CustomObject->MemChipSelectHighTimeCycle;
  CustomObject->Private.Handle->Init.FreeRunningClock        = HAL_XSPI_FREERUNCLK_DISABLE;
  CustomObject->Private.Handle->Init.ClockMode               = HAL_XSPI_CLOCK_MODE_0;

  /* Used for PSRAM */
  CustomObject->Private.Handle->Init.WrapSize                = HAL_XSPI_WRAP_NOT_SUPPORTED;
  CustomObject->Private.Handle->Init.ChipSelectBoundary      = HAL_XSPI_BONDARYOF_NONE;
  CustomObject->Private.Handle->Init.Refresh                 = 0;

