STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
  /* Additional settings that could be provided in configuration file.
     If not provided, XPSI configuration as done by CubeMX tool will apply.
     If provided, setting value in configuration file will apply */
  /* Sample Shift setting */
  if (IS_CUSTOM_SETTING_CFG_DEFINED(CustomObject->SampleShiftCfg))
  {
    CustomObject->Private.Handle->Init.SampleShifting        = CUSTOM_SETTING_CFG_VALUE(CustomObject->SampleShiftCfg);
  }
  /* Other settings (that could be applied to older XSPI versions for instance, for debug purposes
     CustomObject->Private.Handle->Init.DelayHoldQuarterCycle     = HAL_XSPI_DHQC_DISABLE;
  */
  /* Selected by user. Linked to IO Manager and PCB */
  /*
  CustomObject->Private.Handle->Init.MaxTran = 0;
  CustomObject->Private.Handle->Init.MemorySelect = HAL_XSPI_CSSEL_NCS1;
  */

  /* DeInit the XSPI */
  if (HAL_XSPI_DeInit(CustomObject->Private.Handle) != HAL_OK)
  {
    DEBUG_STR("[ERROR] XSPI DeInit (before Init)");
    retr = CUSTOM_XSPI_KO;
  }

  /* Init the XSPI */
  if (HAL_XSPI_Init(CustomObject->Private.Handle) != HAL_OK)
  {
    DEBUG_STR("[ERROR] XSPI Init");
    retr = CUSTOM_XSPI_KO;
  }

  return retr;
}

/**
  * @brief This function de-initializes the XSPI peripheral associated to Custom Driver object
  *        and resets the associated Command descriptor.
  * @param CustomObject Custom driver object
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_DeInit(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject)
{
  CUSTOM_XSPI_StatusTypeDef retr = CUSTOM_XSPI_OK;
  XSPI_RegularCmdTypeDef *sCommand = &CustomObject->Private.Commandbase;

  /* Check if XSPI is not already in reset state */
  if (CustomObject->Private.Handle->State != HAL_XSPI_STATE_RESET)
  {
    /* Implementation of reset procedure if specified in configuration file (stored in CustomObject structure) */
    if (CustomObject->ResetMethod != EXTMEM_CUSTOM_RESET_METHOD_UNDEFINED)
    {
      /* Execute Reset procedure */
      if (CUSTOM_XSPI_OK != CUSTOM_XSPI_ResetMemory(CustomObject))
      {
        retr = CUSTOM_XSPI_KO;
      }
    }

    /* De-init the XSPI */
    if (HAL_XSPI_DeInit(CustomObject->Private.Handle) != HAL_OK)
    {
      DEBUG_STR("[ERROR] XSPI DeInit");
      retr = CUSTOM_XSPI_KO;
    }
    else
    {
      /* Reset Command Base */
      sCommand->OperationType         = HAL_XSPI_OPTYPE_COMMON_CFG;
      sCommand->IOSelect              = HAL_XSPI_SELECT_IO_3_0;
      sCommand->Instruction           = 0;

      /* Instruction part */
      sCommand->InstructionMode       = HAL_XSPI_INSTRUCTION_NONE;
      sCommand->InstructionWidth      = HAL_XSPI_INSTRUCTION_8_BITS;
      sCommand->InstructionDTRMode    = HAL_XSPI_INSTRUCTION_DTR_DISABLE;

      /* Address part */
      sCommand->Address               = 0;
      sCommand->AddressMode           = HAL_XSPI_ADDRESS_NONE;
      sCommand->AddressWidth          = HAL_XSPI_ADDRESS_8_BITS;
      sCommand->AddressDTRMode        = HAL_XSPI_ADDRESS_DTR_DISABLE;

      /* Alternate Byte mode not yet supported */
      sCommand->AlternateBytes        = 0;
      sCommand->AlternateBytesMode    = HAL_XSPI_ALT_BYTES_NONE;
      sCommand->AlternateBytesWidth   = HAL_XSPI_ALT_BYTES_8_BITS;
      sCommand->AlternateBytesDTRMode = HAL_XSPI_ALT_BYTES_DTR_DISABLE;

      /* Data part */
      sCommand->DataMode              = HAL_XSPI_DATA_NONE;
      sCommand->DataLength            = 0;
      sCommand->DataDTRMode           = HAL_XSPI_DATA_DTR_DISABLE;

      /* Others settings */
      sCommand->DummyCycles           = 0;
      sCommand->DQSMode               = HAL_XSPI_DQS_DISABLE;
    }
  }

  return retr;
}

/**
  * @brief This function sets the clock provided to memory according to input clock and request
  * @param CustomObject Custom driver object
  * @param ClockIn Input clock
  * @param ClockRequested Expected clock frequency value
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetClock(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                      uint32_t ClockIn, uint32_t ClockRequested)
{
  CUSTOM_XSPI_StatusTypeDef retr = CUSTOM_XSPI_OK;
  uint32_t divider   = 0;
  uint32_t ClockReal = 0;

  /* As requested clock value will be checked against all possible divisions of input clock, it could happen that
     division result exceeds clock value provided in configuration file.
     For example, if input clock is 400Mhz and requested clock is 133 Mhz, input clock/3 will exceed
     configuration file value.
     In order to allow such use case, requested clock value is slightly increased (for values > 50 Mhz) */
  if (ClockRequested > CUSTOM_CLOCK_VALUE_FOR_ROUNDING)
  {
    ClockRequested += CUSTOM_CLOCK_VALUE_INCREMENT;
  }

  if (ClockRequested == 0u)
  {
    retr = CUSTOM_XSPI_KO;
  }
  else
  {
    divider = (ClockIn / ClockRequested);
    if (divider >= 1u)
    {
      ClockReal = ClockIn / divider;
      if (ClockReal <= ClockRequested)
      {
        divider--;
      }
    }

    /* Real clock calculation */
    ClockReal = ClockIn / (divider + 1u);
    CustomObject->Private.RealClock = ClockReal;

    MODIFY_REG(CustomObject->Private.Handle->Instance->DCR2, XSPI_DCR2_PRESCALER,
               (uint32_t)divider << XSPI_DCR2_PRESCALER_Pos);
  }

  DEBUG_STR_INT("[CLOCK] New clock: ", CustomObject->Private.RealClock);

  return retr;
}

/**
  * @brief This function performs a Read Register operation
  * @param CustomObject Custom driver object
  * @param RegisterConfig Register access details
  * @param ReadType Read type
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_ReadRegister(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                          OptionalRegisterConfigTypeDef *RegisterConfig,
                                                          CUSTOM_XSPI_ReadTypeTypeDef ReadType)
{
  CUSTOM_XSPI_StatusTypeDef retr   = CUSTOM_XSPI_OK;
  XSPI_RegularCmdTypeDef *sCommand = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi        = CustomObject->Private.Handle;
  uint32_t SavedCommand            = 0;
  uint8_t reg[2]                   = {0};

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  /* Initialize command instruction to be sent */
  sCommand->OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;

  /* Check if read operation */
  if (IS_CFGSTEP_REG_ACCESS_TYPE(RegisterConfig->ConfigStepType))
  {
    /* Check if Read operation is the initial one or after the Write operation */
    if (ReadType == CUSTOM_XSPI_READ_TYPE_INITIAL)
    {
      sCommand->Instruction = RegisterConfig->RWConfigStep.CommandRegisterRead;
      DEBUG_STR_HEX("[READ REG INITIAL] Command: ", sCommand->Instruction);
    }
    else if (ReadType == CUSTOM_XSPI_READ_TYPE_AFTER_WRITE)
    {
      sCommand->Instruction = RegisterConfig->RWConfigStep.CommandRegisterReadAW;
      DEBUG_STR_HEX("[READ AFTER WRITE] Command: ", sCommand->Instruction);
    }
    else
    {
      /* Unexpected type of Read operation */
      retr = CUSTOM_XSPI_KO;
      goto error;
    }

    /* Check if Read register use an address */
    if (IS_CFGSTEP_ADDR(RegisterConfig->ConfigStepType))
    {
      sCommand->Address = RegisterConfig->RWConfigStep.RegisterAddress;
      DEBUG_STR_HEX("[READ WITH ADDR  ] Address: ", sCommand->Address);
    }
    else
    {
      sCommand->AddressMode = HAL_XSPI_ADDRESS_NONE;
    }

