STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
  }
  else
  {
    /* Unexpected type of Register config element */
    retr = CUSTOM_XSPI_KO;
    goto error;
  }

  /* Check if command use DTR mode */
  if (sCommand->DataDTRMode == HAL_XSPI_DATA_DTR_ENABLE)
  {
    sCommand->DataLength    = 2;
  }
  else
  {
    sCommand->DataLength    = 1;
  }

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    DEBUG_STR_HEX("[ERROR] Read Register Command:  ", sCommand->Instruction);
    retr = CUSTOM_XSPI_KO;
    goto error;
  }

  if (HAL_XSPI_Receive(hxspi, reg, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    DEBUG_STR_HEX("[ERROR] Read Register Value:  ", reg[0]);
    retr = CUSTOM_XSPI_KO;
    goto error;
  }

  /* Can be used for debug */
  CustomObject->Private.ReadRegValue = reg[0];
  DEBUG_STR_HEX("[READ REG        ] Value:   ", CustomObject->Private.ReadRegValue);

error:
  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

  return retr;
}

/**
  * @brief This function performs a Write Register operation
  * @param CustomObject Custom driver object
  * @param RegisterConfig Register access details
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_WriteRegister(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                           OptionalRegisterConfigTypeDef *RegisterConfig)
{
  CUSTOM_XSPI_StatusTypeDef retr   = CUSTOM_XSPI_OK;
  XSPI_RegularCmdTypeDef *sCommand = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi        = CustomObject->Private.Handle;
  uint32_t SavedCommand            = 0;
  uint8_t reg[2]                   = {0};
  uint32_t reg_value               = 0;
  uint32_t mask                    = 0;

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  DEBUG_STR_HEX("[WRITE REG] Command:  ", RegisterConfig->RWConfigStep.CommandRegisterWrite);

  /* Initialize mask and register reg */
  if (IS_CFGSTEP_DATASIZE_16BIT(RegisterConfig->ConfigStepType))
  {
    /* 16 bits register content */
    mask = (0xFFFFU - ((RegisterConfig->RWConfigStep.RegisterMask) & 0xFFFFU));
    reg_value = ((RegisterConfig->RWConfigStep.RegisterValue & RegisterConfig->RWConfigStep.RegisterMask) & 0xFFFFU)
                | (CustomObject->Private.ReadRegValue & mask);
    reg[0] = (uint8_t)(reg_value >> 8U);
    reg[1] = (uint8_t)(reg_value & 0xFFU);

    sCommand->DataLength    = 2;

    DEBUG_STR_HEX("[WRITE REG]  Value1:  ", reg[0]);
    DEBUG_STR_HEX("[WRITE REG]  Value2:  ", reg[1]);
  }
  else
  {
    /* 8 bits register content */
    mask = (0xFFU - ((RegisterConfig->RWConfigStep.RegisterMask) & 0xFFU));
    reg[0] = ((RegisterConfig->RWConfigStep.RegisterValue & RegisterConfig->RWConfigStep.RegisterMask) & 0xFFU)
             | (CustomObject->Private.ReadRegValue & mask);

    /* Check if command use DTR mode */
    if (sCommand->DataDTRMode == HAL_XSPI_DATA_DTR_ENABLE)
    {
      sCommand->DataLength    = 2;
      reg[1] = reg[0];
    }
    else
    {
      sCommand->DataLength    = 1;
    }
    DEBUG_STR_HEX("[WRITE REG]   Value:  ", reg[0]);
  }

  /* Initialize command instruction to be sent */
  sCommand->OperationType   = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->Instruction     = RegisterConfig->RWConfigStep.CommandRegisterWrite;
  sCommand->DummyCycles     = 0;

  /* Check if Write register operation use an address */
  if (IS_CFGSTEP_ADDR(RegisterConfig->ConfigStepType))
  {
    sCommand->Address = RegisterConfig->RWConfigStep.RegisterAddress;
    DEBUG_STR_HEX("[WRITE REG] Address: ", sCommand->Address);
  }
  else
  {
    sCommand->AddressMode = HAL_XSPI_ADDRESS_NONE;
  }

  /* Send Command */
  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    DEBUG_STR_HEX("[ERROR] Write Register Command:  ", sCommand->Instruction);
    retr = CUSTOM_XSPI_KO;
    goto error;
  }

  if (HAL_XSPI_Transmit(hxspi, reg, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    DEBUG_STR_HEX("[ERROR] Write Register Value:  ", reg[0]);
    retr = CUSTOM_XSPI_KO;
    goto error;
  }

error:
  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

  return retr;
}

/**
  * @brief This function sends a specific Instruction to memory
  * @param CustomObject Custom driver object
  * @param Instruction Instruction code
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_Send_Instruction(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject,
                                                              uint32_t Instruction)
{
  CUSTOM_XSPI_StatusTypeDef retr   = CUSTOM_XSPI_OK;
  XSPI_RegularCmdTypeDef *sCommand = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi        = CustomObject->Private.Handle;
  uint32_t SavedCommand            = 0;

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  /* Initialize command instruction to be sent */
  sCommand->OperationType    = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->Instruction      = Instruction;
  sCommand->AddressMode      = HAL_XSPI_ADDRESS_NONE;
  sCommand->DataMode         = HAL_XSPI_DATA_NONE;

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    retr = CUSTOM_XSPI_KO;
  }

  DEBUG_STR_HEX("[INSTRUCTION] Command:  ", sCommand->Instruction);

  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

  return retr;
}

/**
  * @brief This function performs a Memory Reset operation
  * @param CustomObject Custom driver object
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_ResetMemory(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject)
{
  CUSTOM_XSPI_StatusTypeDef retr   = CUSTOM_XSPI_OK;
  XSPI_RegularCmdTypeDef *sCommand = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi        = CustomObject->Private.Handle;
  MemoryBaseConfigTypeDef *memCfg;
  uint32_t nbConfig = 1;
  uint32_t idx = 0;
  uint32_t SavedCommand = 0;

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  sCommand->OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->AddressMode        = HAL_XSPI_ADDRESS_NONE;
  sCommand->DataMode           = HAL_XSPI_DATA_NONE;
  sCommand->DummyCycles        = 0U;

  /* If there's an optional config then execute reset procedure twice :
  *    First execute Reset command corresponding to Optional config settings,
  *    Second using the startup config settings
  *  Otherwise use directly startup config settings
  */
  if (CustomObject->OptionalConfig.Frequency != 0)
  {
    memCfg = &CustomObject->OptionalConfig;

