STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
    /* If Reset Instruction exist in 16bits and 8 bits, execute both reset instructions */
    if (memCfg->InstructionSize != CustomObject->StartupConfig.InstructionSize)
    {
      nbConfig = 2;
    }
  }
  else
  {
    memCfg = &CustomObject->StartupConfig;
  }

  for (idx = 0; idx < nbConfig; idx++)
  {
    /* Check selected type of Reset procedure */
    switch (CustomObject->ResetMethod)
    {
      /* Reset Method is based on 0x66 and 0x99 instructions */
      case EXTMEM_CUSTOM_RESET_METHOD_66_99 :
      case EXTMEM_CUSTOM_RESET_METHOD_6699_9966 :
      case EXTMEM_CUSTOM_RESET_METHOD_6666_9999 :
      {
        /* Configure Instruction according to Optional configuration description */
        sCommand->InstructionMode       = ((memCfg->AccessMode) & INSTRUCTION_MASK);
        sCommand->InstructionWidth      = memCfg->InstructionSize;
        sCommand->InstructionDTRMode    = ((memCfg->AccessMode) & HAL_XSPI_INSTRUCTION_DTR_ENABLE);

        if (memCfg->InstructionSize == EXTMEM_CUSTOM_INSTRUCTION_8_BITS)
        {
          sCommand->Instruction      = CUSTOM_RESET_INS_66_8BITS;
          if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
          {
            DEBUG_STR_HEX("[ERROR] Reset Command:  ", sCommand->Instruction);
            retr = CUSTOM_XSPI_KO;
          }

          DEBUG_STR_HEX("[RESET] Command:  ", sCommand->Instruction);

          /* Initialize command instruction to be sent */
          sCommand->Instruction      = CUSTOM_RESET_INS_99_8BITS;
          if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
          {
            DEBUG_STR_HEX("[ERROR] Reset Command:  ", sCommand->Instruction);
            retr = CUSTOM_XSPI_KO;
          }
          DEBUG_STR_HEX("[RESET] Command:  ", sCommand->Instruction);
        }
        else if (memCfg->InstructionSize == EXTMEM_CUSTOM_INSTRUCTION_16_BITS)
        {
          if (CustomObject->ResetMethod == EXTMEM_CUSTOM_RESET_METHOD_6699_9966)
          {
            sCommand->Instruction      = CUSTOM_RESET_INS_6699_16BITS;
          }
          else
          {
            sCommand->Instruction      = CUSTOM_RESET_INS_6666_16BITS;
          }
          if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
          {
            DEBUG_STR_HEX("[ERROR] Reset Command:  ", sCommand->Instruction);
            retr = CUSTOM_XSPI_KO;
          }
          DEBUG_STR_HEX("[RESET] Command:  ", sCommand->Instruction);

          /* Initialize command instruction to be sent */
          if (CustomObject->ResetMethod == EXTMEM_CUSTOM_RESET_METHOD_6699_9966)
          {
            sCommand->Instruction      = CUSTOM_RESET_INS_9966_16BITS;
          }
          else
          {
            sCommand->Instruction      = CUSTOM_RESET_INS_9999_16BITS;
          }
          if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
          {
            DEBUG_STR_HEX("[ERROR] Reset Command:  ", sCommand->Instruction);
            retr = CUSTOM_XSPI_KO;
          }
          DEBUG_STR_HEX("[RESET] Command:  ", sCommand->Instruction);
        }
        else
        {
          DEBUG_STR("[ERROR] Reset Command: NOT SUPPORTED ");
          /* Other types of Instructions sizes not handled */
          retr = CUSTOM_XSPI_KO;
        }
      }
      break;

      case EXTMEM_CUSTOM_RESET_METHOD_FF:
      {
        /* Configure Instruction according to Optional configuration description */
        sCommand->InstructionMode       = ((memCfg->AccessMode) & INSTRUCTION_MASK);
        sCommand->InstructionWidth      = memCfg->InstructionSize;
        sCommand->InstructionDTRMode    = ((memCfg->AccessMode) & HAL_XSPI_INSTRUCTION_DTR_ENABLE);

        /* Used Address to generate 4 clocks CS low after instruction (APMemory) */
        sCommand->AddressMode           = HAL_XSPI_ADDRESS_8_LINES;
        sCommand->AddressWidth          = HAL_XSPI_ADDRESS_32_BITS;
        sCommand->AddressDTRMode        = HAL_XSPI_ADDRESS_DTR_DISABLE;

        /* Set Instruction 0xFF in 8bits */
        sCommand->Instruction            = CUSTOM_RESET_INS_FF_8BITS;

        if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
        {
          DEBUG_STR_HEX("[ERROR] Reset Command:  ", sCommand->Instruction);
          retr = CUSTOM_XSPI_KO;
        }
        DEBUG_STR_HEX("[RESET] Command:  ", sCommand->Instruction);
      }
      break;


      default :
        /* Unexpected reset type */
        retr = CUSTOM_XSPI_KO;
        break;
    }

    /* Ensure minimal delay is repseted after Reset, if any */
    if (CustomObject->ResetDelay != 0)
    {
      HAL_Delay(CustomObject->ResetDelay);
    }

    memCfg = &CustomObject->StartupConfig;
  }

  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

  return retr;
}

/**
  * @brief This function configures a Command descriptor according to Configuration object
  * @param ConfigObject Configuration object
  * @param sCommand Command descriptor to be initialised
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetCommand(MemoryBaseConfigTypeDef *ConfigObject,
                                                        XSPI_RegularCmdTypeDef *sCommand)
{
  CUSTOM_XSPI_StatusTypeDef retr  = CUSTOM_XSPI_OK;

  sCommand->OperationType         = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->IOSelect              = HAL_XSPI_SELECT_IO_3_0;
  sCommand->Instruction           = 0;

  /* Instruction part */
  sCommand->InstructionMode       = ((ConfigObject->AccessMode) & INSTRUCTION_MASK);
  sCommand->InstructionWidth      = ConfigObject->InstructionSize;
  sCommand->InstructionDTRMode    = ((ConfigObject->AccessMode) & HAL_XSPI_INSTRUCTION_DTR_ENABLE);

  /* Address part */
  sCommand->Address               = 0;
  sCommand->AddressMode           = ((ConfigObject->AccessMode) & ADDRESS_MASK);
  sCommand->AddressWidth          = ConfigObject->AddressSize;
  sCommand->AddressDTRMode        = ((ConfigObject->AccessMode) & HAL_XSPI_ADDRESS_DTR_ENABLE);

