STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
  /* Alternate Byte mode not yet supported */
  sCommand->AlternateBytes        = 0;
  sCommand->AlternateBytesMode    = HAL_XSPI_ALT_BYTES_NONE;
  sCommand->AlternateBytesWidth   = HAL_XSPI_ALT_BYTES_8_BITS;
  sCommand->AlternateBytesDTRMode = HAL_XSPI_ALT_BYTES_DTR_DISABLE;

  /* Data part */
  sCommand->DataMode              = ((ConfigObject->AccessMode) & DATA_MASK);;
  sCommand->DataLength            = 0;
  sCommand->DataDTRMode           = ((ConfigObject->AccessMode) & HAL_XSPI_DATA_DTR_ENABLE);;

  /* Others settings */
  sCommand->DummyCycles           = ConfigObject->DummyRegisterRead;
  sCommand->DQSMode               = ConfigObject->DqsMode;

  return retr;
}

/**
  * @brief Saves the command descriptor to the specified location.
  * @param sCommand Pointer to the command to save.
  * @param CommandToSave Pointer to the location where the command will be saved.
  */
static void CUSTOM_XSPI_SaveCommand(XSPI_RegularCmdTypeDef *sCommand, uint32_t *CommandToSave)
{
  /* Save global command */
  *CommandToSave = ((sCommand->InstructionMode & XSPI_CCR_IMODE_Msk) |
                    (sCommand->InstructionWidth & XSPI_CCR_ISIZE_Msk) |
                    (sCommand->InstructionDTRMode & XSPI_CCR_IDTR_Msk) |
                    (sCommand->AddressMode & XSPI_CCR_ADMODE_Msk) |
                    (sCommand->AddressWidth & XSPI_CCR_ADSIZE_Msk) |
                    (sCommand->AddressDTRMode & XSPI_CCR_ADDTR_Msk) |
                    (sCommand->DataMode & XSPI_CCR_DMODE_Msk) |
                    (sCommand->DataDTRMode & XSPI_CCR_DDTR_Msk) |
                    (sCommand->DQSMode & XSPI_CCR_DQSE_Msk) |
                    ((sCommand->DummyCycles & XSPI_TCR_DCYC_Msk) << XSPI_CCR_ABMODE_Pos));
}

/**
  * @brief Restores the command descriptor from the specified location.
  * @param sCommand Pointer to the command to restore.
  * @param CommandSaved Pointer to the saved command used for restoration.
  */
static void CUSTOM_XSPI_RestoreCommand(XSPI_RegularCmdTypeDef *sCommand, uint32_t *CommandSaved)
{
  /* Restore instruction command part */
  sCommand->InstructionMode       = ((*CommandSaved) & XSPI_CCR_IMODE_Msk);
  sCommand->InstructionWidth      = ((*CommandSaved) & XSPI_CCR_ISIZE_Msk);
  sCommand->InstructionDTRMode    = ((*CommandSaved) & XSPI_CCR_IDTR_Msk);

  /* Restore Address command part */
  sCommand->AddressMode           = ((*CommandSaved) & XSPI_CCR_ADMODE_Msk);
  sCommand->AddressWidth          = ((*CommandSaved) & XSPI_CCR_ADSIZE_Msk);
  sCommand->AddressDTRMode        = ((*CommandSaved) & XSPI_CCR_ADDTR_Msk);

  /* Alternate Byte mode not yet supported */
  sCommand->AlternateBytes        = 0;
  sCommand->AlternateBytesMode    = HAL_XSPI_ALT_BYTES_NONE;
  sCommand->AlternateBytesWidth   = HAL_XSPI_ALT_BYTES_8_BITS;
  sCommand->AlternateBytesDTRMode = HAL_XSPI_ALT_BYTES_DTR_DISABLE;

  /* Restore Data command part */
  sCommand->DataMode              = ((*CommandSaved) & XSPI_CCR_DMODE_Msk);
  sCommand->DataDTRMode           = ((*CommandSaved) & XSPI_CCR_DDTR_Msk);

  /* Restore DQS and Dummycycles settings of the command */
  sCommand->DummyCycles           = (((*CommandSaved) >> XSPI_CCR_ABMODE_Pos) & XSPI_TCR_DCYC_Msk);
  sCommand->DQSMode               = ((*CommandSaved) & XSPI_CCR_DQSE_Msk);
}

/**
  * @brief Configures a Write Command descriptor according to the configuration object.
  * @param ConfigObject Pointer to the configuration object.
  * @param sCommand Pointer to the command descriptor to initialize.
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetWriteCommand(MemoryBaseConfigTypeDef *ConfigObject,
                                                             XSPI_RegularCmdTypeDef *sCommand)
{
  CUSTOM_XSPI_StatusTypeDef retr  = CUSTOM_XSPI_OK;

  sCommand->OperationType         = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->IOSelect              = HAL_XSPI_SELECT_IO_3_0;
  sCommand->Instruction           = 0;

  /* Instruction part */
  sCommand->InstructionMode       = ((ConfigObject->OptWriteAccessMode) & INSTRUCTION_MASK);
  sCommand->InstructionWidth      = ConfigObject->InstructionSize;
  sCommand->InstructionDTRMode    = ((ConfigObject->OptWriteAccessMode) & HAL_XSPI_INSTRUCTION_DTR_ENABLE);

  /* Address part */
  sCommand->Address               = 0;
  sCommand->AddressMode           = ((ConfigObject->OptWriteAccessMode) & ADDRESS_MASK);
  sCommand->AddressWidth          = ConfigObject->AddressSize;
  sCommand->AddressDTRMode        = ((ConfigObject->OptWriteAccessMode) & HAL_XSPI_ADDRESS_DTR_ENABLE);

  /* Alternate Byte mode not yet supported */
  sCommand->AlternateBytes        = 0;
  sCommand->AlternateBytesMode    = HAL_XSPI_ALT_BYTES_NONE;
  sCommand->AlternateBytesWidth   = HAL_XSPI_ALT_BYTES_8_BITS;
  sCommand->AlternateBytesDTRMode = HAL_XSPI_ALT_BYTES_DTR_DISABLE;

  /* Data part */
  sCommand->DataMode              = ((ConfigObject->OptWriteAccessMode) & DATA_MASK);;
  sCommand->DataLength            = 0;
  sCommand->DataDTRMode           = ((ConfigObject->OptWriteAccessMode) & HAL_XSPI_DATA_DTR_ENABLE);;

  /* Others settings */
  sCommand->DummyCycles           = ConfigObject->DummyCycleWrite;
  sCommand->DQSMode               = ConfigObject->DqsMode;

  return retr;
}

/**
  * @brief Sets the Write Enable (WE) bit in the memory device.
  * @param hxspi Pointer to the HAL XSPI handle.
  * @param sCommand Pointer to the command descriptor to use.
  * @param NorConfig Pointer to the Nor Flash configuration descriptor.
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_SetWriteEnable(XSPI_HandleTypeDef *hxspi, XSPI_RegularCmdTypeDef *sCommand,
                                                            NorFlashBasConfigTypeDef *NorConfig)
{
  CUSTOM_XSPI_StatusTypeDef retr  = CUSTOM_XSPI_OK;
  XSPI_AutoPollingTypeDef sConfig = {0};
  uint32_t SavedCommand           = 0;

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  /* Initialize command instruction to be sent */
  sCommand->OperationType   = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->Instruction     = NorConfig->Cmd_WE;
  sCommand->AddressMode     = HAL_XSPI_ADDRESS_NONE;
  sCommand->DataMode        = HAL_XSPI_DATA_NONE;
  sCommand->DummyCycles     = 0;

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    retr = CUSTOM_XSPI_KO;
    DEBUG_STR_HEX("[ERROR] WEL Command:  ", sCommand->Instruction);
    goto error;
  }
  DEBUG_STR_HEX("\t[WEL] Command:  ", sCommand->Instruction);

  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

