STMicroelectronics/STM32CubeH7RS/Middlewares/ST/STM32_ExtMem_Manager/custom/stm32_custom_driver.c
  /* Reconfigure XSPI to automatic polling mode to wait for write enabling */
  sCommand->Instruction     = NorConfig->Cmd_RDSR;

  if (sCommand->DataDTRMode == HAL_XSPI_DATA_DTR_ENABLE)
  {
    sCommand->DataLength    = 2;
  }
  else
  {
    sCommand->DataLength    = 1;
  }

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    retr = CUSTOM_XSPI_KO;
    DEBUG_STR_HEX("[ERROR] RDSR Command:  ", sCommand->Instruction);
    goto error;
  }

  /* Reconfigure XSPI to automatic polling mode to wait for write enabling */
  sConfig.MatchMode         = HAL_XSPI_MATCH_MODE_AND;
  sConfig.AutomaticStop     = HAL_XSPI_AUTOMATIC_STOP_ENABLE;
  sConfig.IntervalTime      = 0x10;
  sConfig.MatchMask         = NorConfig->MatchMask_WEL;
  sConfig.MatchValue        = NorConfig->MatchValue_WEL;

  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    retr = CUSTOM_XSPI_KO;
    DEBUG_STR("[ERROR] WEL Autopolling: ");
    DEBUG_STR_HEX("[ERROR] WEL MatchMask:  ", NorConfig->MatchMask_WEL);
    DEBUG_STR_HEX("[ERROR] WEL MatchValue: ", NorConfig->MatchValue_WEL);
    DEBUG_STR_HEX("[ERROR] Real Value: ", hxspi->Instance->DR);
    goto error;
  }

error:
  /* Restore XSPI command in case of error */
  if (retr != CUSTOM_XSPI_OK)
  {
    CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);
  }

  return retr;
}

/**
  * @brief Gets the Write In Progress (WIP) bit from the memory device.
  * @param hxspi Pointer to the HAL XSPI handle.
  * @param sCommand Pointer to the command descriptor to use.
  * @param NorConfig Pointer to the Nor Flash configuration descriptor.
  * @param Timeout Maximum duration allowed for the WIP check to succeed (no Write In Progress).
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_GetWriteInProgress(XSPI_HandleTypeDef *hxspi,
                                                                XSPI_RegularCmdTypeDef *sCommand,
                                                                NorFlashBasConfigTypeDef *NorConfig,
                                                                uint32_t Timeout)
{
  CUSTOM_XSPI_StatusTypeDef retr  = CUSTOM_XSPI_OK;
  XSPI_AutoPollingTypeDef sConfig = {0};
  uint32_t SavedCommand           = 0;

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  /* Initialize command instruction to be sent */
  sCommand->Instruction     = NorConfig->Cmd_RDSR;

  /* Check if Address is to be provided for access Status Register :
     If not provided, no address field to be sent in command.
     If provided, address value present in configuration file will apply */
  if (IS_CUSTOM_SETTING_CFG_DEFINED(NorConfig->SRAccessDetails))
  {
    sCommand->Address       = CUSTOM_SETTING_CFG_VALUE(NorConfig->SRAccessDetails);
  }
  else
  {
    sCommand->AddressMode   = HAL_XSPI_ADDRESS_NONE;
  }

  if (sCommand->DataDTRMode == HAL_XSPI_DATA_DTR_ENABLE)
  {
    sCommand->DataLength    = 2;
  }
  else
  {
    sCommand->DataLength    = 1;
  }

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    DEBUG_STR_HEX("[ERROR] RDSR Command:  ", sCommand->Instruction);
    retr = CUSTOM_XSPI_KO;
  }

  /* Reconfigure XSPI to automatic polling mode to wait for write enabling */
  sConfig.MatchMode         = HAL_XSPI_MATCH_MODE_AND;
  sConfig.AutomaticStop     = HAL_XSPI_AUTOMATIC_STOP_ENABLE;
  sConfig.IntervalTime      = 0x10;
  sConfig.MatchMask         = NorConfig->MatchMask_WIP;
  sConfig.MatchValue        = NorConfig->MatchValue_WIP;

  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, Timeout) != HAL_OK)
  {
    DEBUG_STR("[ERROR] WIP Autopolling: ");
    DEBUG_STR_HEX("[ERROR] WIP MatchMask:  ", NorConfig->MatchMask_WIP);
    DEBUG_STR_HEX("[ERROR] WIP MatchValue: ", NorConfig->MatchValue_WIP);
    DEBUG_STR_HEX("[ERROR] Real Value: ", hxspi->Instance->DR);
    retr = CUSTOM_XSPI_KO;
  }

  DEBUG_STR_HEX("\t[WIP] Command:  ", sCommand->Instruction);

  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

  return retr;
}

/**
  * @brief Retrieves the JEDEC ID from the memory device.
  * @param CustomObject Pointer to the custom driver object.
  * @retval @ref CUSTOM_XSPI_StatusTypeDef
  */
static CUSTOM_XSPI_StatusTypeDef CUSTOM_XSPI_GetJedecID(EXTMEM_DRIVER_CUSTOM_ObjectTypeDef *CustomObject)
{
  CUSTOM_XSPI_StatusTypeDef retr   = CUSTOM_XSPI_OK;
  XSPI_RegularCmdTypeDef *sCommand = &CustomObject->Private.Commandbase;
  XSPI_HandleTypeDef *hxspi        = CustomObject->Private.Handle;
  uint32_t SavedCommand            = 0;

  /* Save current XSPI command */
  CUSTOM_XSPI_SaveCommand(sCommand, &SavedCommand);

  /* Initialize command instruction to be sent */
  sCommand->OperationType     = HAL_XSPI_OPTYPE_COMMON_CFG;
  sCommand->Instruction       = EXTMEM_CUSTOM_JEDECID_CMD;
  sCommand->AddressMode       = HAL_XSPI_ADDRESS_NONE;
  sCommand->DataLength        = EXTMEM_CUSTOM_JEDECID_SIZE;
  sCommand->DummyCycles       = 0;

  if (HAL_XSPI_Command(hxspi, sCommand, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    DEBUG_STR_HEX("[ERROR] JEDEC ID Command:  ", sCommand->Instruction);
    retr = CUSTOM_XSPI_KO;
  }

  if (HAL_XSPI_Receive(hxspi, (uint8_t *) &CustomObject->Private.JedecID, CUSTOM_XSPI_TIMEOUT_VALUE) != HAL_OK)
  {
    retr = CUSTOM_XSPI_KO;
  }

  DEBUG_STR_HEX("[JEDEC ID] Manufacturer ID :", CustomObject->Private.JedecID.ManufacturerID);
  DEBUG_STR_HEX("[JEDEC ID] Memory type     :", CustomObject->Private.JedecID.MemoryType);
  DEBUG_STR_HEX("[JEDEC ID] Memory density  :", CustomObject->Private.JedecID.MemoryDensity);

  /* Restore XSPI command previously saved */
  CUSTOM_XSPI_RestoreCommand(sCommand, &SavedCommand);

  return retr;
}

/**
  * @}
  */

/**
  * @}
  */
#endif /* EXTMEM_DRIVER_CUSTOM == 1 */
